STL_IGU_28_N6_AER4/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    windowsmall
    {
        type            fixedValue;
        value           uniform 0;
    }
    door
    {
        type            fixedValue;
        value           uniform 0;
    }
    columns
    {
        type            fixedValue;
        value           uniform 0;
    }
    windowbig
    {
        type            fixedValue;
        value           uniform 0;
    }
    ceiling
    {
        type            fixedValue;
        value           uniform 0;
    }
    floor
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallwindow
    {
        type            fixedValue;
        value           uniform 0;
    }
    walldoor
    {
        type            fixedValue;
        value           uniform 0;
    }
    walloutside
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallinside
    {
        type            fixedValue;
        value           uniform 0;
    }
    emission_surface
    {
        type            fixedValue;
        value           uniform 0;
    }
    n_001
    {
        type            fixedValue;
        value           uniform 0;
    }
    n_002
    {
        type            fixedValue;
        value           uniform 0;
    }
    n_003
    {
        type            fixedValue;
        value           uniform 0;
    }
    n_004
    {
        type            fixedValue;
        value           uniform 0;
    }
    n_005
    {
        type            fixedValue;
        value           uniform 0;
    }
    n_006
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
